In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('customer_segmentation_full.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10695 entries, 0 to 10694
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               10695 non-null  int64
 1   Gender           10695 non-null  object
 2   Ever_Married     10505 non-null  object
 3   Age              10695 non-null  int64
 4   Graduated        10593 non-null  object
 5   Profession       10533 non-null  object
 6   Work_Experience  9597 non-null   float64
 7   Spending_Score   10695 non-null  object
 8   Family_Size      10247 non-null  float64
 9   Var_1            10587 non-null  object
 10  Segmentation     10695 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 919.2+ KB

In [6]:
A# Display the first few rows
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [8]:
duplicates = df[df.duplicated(subset = df.columns.drop("Segmentation"))]
duplicates

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
8084,459036,Female,Yes,20,Yes,Lawyer,1.0,Average,3.0,Cat_3,D
8085,459039,Male,Yes,45,Yes,Artist,1.0,Average,2.0,Cat_6,B
8146,459223,Female,Yes,47,Yes,Doctor,1.0,Average,4.0,Cat_6,C
8172,459320,Male,Yes,26,Yes,Executive,0.0,Low,3.0,Cat_6,D
8221,459447,Male,Yes,53,Yes,Artist,9.0,Low,1.0,Cat_6,C
...,...,...,...,...,...,...,...,...,...,...,...
10606,467678,Male,No,56,No,Marketing,1.0,Low,2.0,Cat_6,A
10621,467726,Male,Yes,82,Yes,Lawyer,0.0,High,2.0,Cat_6,A
10655,467860,Female,No,33,Yes,Entertainment,0.0,Low,1.0,Cat_7,A
10661,467879,Female,Yes,51,Yes,Artist,NaN,High,4.0,Cat_6,A
10667,467892,Male,No,23,No,Doctor,1.0,Low,5.0,Cat_6,D

In [13]:
df.isnull().sum()

ID                    0
Gender                0
Ever_Married        190
Age                   0
Graduated           102
Profession          162
Work_Experience    1098
Spending_Score        0
Family_Size         448
Var_1               108
Segmentation          0
dtype: int64

In [10]:
# Replace NaN in 'Ever_Married' with mode value
mode_ever_married = df['Ever_Married'].mode()[0]
df['Ever_Married'].fillna(mode_ever_married, inplace=True)

C:\Users\hxiuf\AppData\Local\Temp\ipykernel_12492\2401906689.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Ever_Married'].fillna(mode_ever_married, inplace=True)

In [12]:
# Replace NaN in 'Graduated' with mode value
mode_graduated = df['Graduated'].mode()[0]
df['Graduated'].fillna(mode_graduated, inplace=True)

C:\Users\hxiuf\AppData\Local\Temp\ipykernel_12492\409270212.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Graduated'].fillna(mode_graduated, inplace=True)

In [14]:
# Replace NaN in 'Work_Experience' with mean value
mean_work_experience = df['Work_Experience'].mean()
df['Work_Experience'].fillna(mean_work_experience, inplace=True)

C:\Users\hxiuf\AppData\Local\Temp\ipykernel_12492\2674526876.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Work_Experience'].fillna(mean_work_experience, inplace=True)

In [16]:
# Replace NaN in 'Profession' with 'Unknown'
df['Profession'].fillna('Unknown', inplace=True)

C:\Users\hxiuf\AppData\Local\Temp\ipykernel_12492\140688588.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Profession'].fillna('Unknown', inplace=True)

In [18]:
# Replace NaN in 'Family_Size' with mean value
mean_family_size = df['Family_Size'].mean()
df['Family_Size'].fillna(mean_family_size, inplace=True)

C:\Users\hxiuf\AppData\Local\Temp\ipykernel_12492\45170972.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Family_Size'].fillna(mean_family_size, inplace=True)

In [20]:
# Drop rows without 'Var_1' value
df.dropna(subset=['Var_1'], inplace=True)

In [22]:
# Display the DataFrame information again
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10587 entries, 0 to 10694
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               10587 non-null  int64
 1   Gender           10587 non-null  object
 2   Ever_Married     10587 non-null  object
 3   Age              10587 non-null  int64
 4   Graduated        10587 non-null  object
 5   Profession       10587 non-null  object
 6   Work_Experience  10587 non-null  float64
 7   Spending_Score   10587 non-null  object
 8   Family_Size      10587 non-null  float64
 9   Var_1            10587 non-null  object
 10  Segmentation     10587 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 992.5+ KB

In [ ]:
# save the cleaned dataset to a csv file
df.to_csv('customer_segmentation_cleaned.csv', index=False)